export default {
  home: 'Главная',
  about: 'О сервисе',
  contacts: 'Контакты',

  menu: {
    home: 'Главная',
    about: 'О сервисе',
    contacts: 'Контакты',
    translations: 'Переводы',
    theme: 'Переключение темы',
    exit: 'Выход'
  },

  locale: {
    English: 'Английский',
    Russia: 'Русский',
    Ukraine: 'Украинский'
  },

  homepage: {
    title: 'Конвертер паролей из кириллицы в латиницу',
    input_title: 'CyrToLat Конвертер',
    input_description:
      'Сервис конвертации паролей с кириллицы на латиницу. Он предназначен для пользователей, использующих пароли на русском языке (зашифрованные на кириллической раскладке клавиатуры).',
    input_placeholder: 'Введите пароль для перевода...',
    input_btn: 'конвертировать'
  }
};
