export default {
  menu: {
    home: 'Головна',
    about: 'Про сервіс',
    contacts: 'Контакти',
    translations: 'Переклади',
    theme: 'Перемикання теми',
    exit: 'Вихід'
  },

  home: {
    title: 'Конвертер кирилиці в латиницю',
    caption: 'Cyr\u202FTo\u202FLat Конвертер',
    comment: 'Сервіс для перекладу рядка тексту з кирилиці на латиницю.',
    placeholder: 'Введіть рядок тексту для перетворення...',
    button: 'Конвертувати'
  },

  about: {
    title: 'Про сервіс',
    caption: 'Про сервіс',
    comment:
      "\u2003Сервіс розроблений спеціально для перекладу рядка тексту з російської розкладки в англійську.\n\u2003Він орієнтований на користувачів, які використовують паролі на російській мові (зашифровані в російській розкладці). Такі паролі дуже зручні: вони легко запам'ятовуються, а виглядають як набір безглуздих латинських букв. Але мають один суттєвий недолік - при роботі з мобільного пристрою на екрані смартфона (або планшета) відображається тільки англійська набір символів. А щоб ввести пароль з російських слів в англійській розкладці - необхідно мати комп'ютерну клавіатуру перед очима. Для вирішення цієї проблеми використовуйте наш сервіс.\n\u2003Сервіс змінює розкладку в зворотну сторону, конвертуючи російські слова в набір латинських символів (включаючи спеціальні знаки: коми, слеш та ін.)."
  },

  contacts: {
    title: "Зв'яжіться зі мною",
    caption: 'Привіт і ласкаво прошу',
    author: 'Я Дмитро Баклай',
    comment:
      'Я - початківець Node.js Full Stack розробник. Займаюся створенням мікросервісов, REST, API більше 1 року. Маю досвід роботи з такими фреймворки як Vue.js, Nuxt.js, Express. Маю досвід роботи з базами даних MySQL, MongoDB. Крім того, займаюся програмуванням на MathCad, Pascal, Delphi, C #, JavaScript.'
  },

  msg: {
    pass_required: 'Потрібно рядок тексту!',
    pass_example: 'Приклад: ~`!№_()#@$%^&*+=-[]\';.,/{}|":<>а-яА-ЯёЁїЇєЄіІ0-9',
    pass_clipboard: 'Рядок тексту скопійовано в буфер обміну!',
    pass_clipboard_error: 'Не вдалося скопіювати рядок тексту!',
    pass_undefined: 'Введіть вашу рядок тексту для перекладу!'
  }
};
