<template>
  <v-layout align-center>
    <v-flex>
      <v-card
        dark
        max-width="500"
        class="mx-auto"
        color="transparent"
        elevation="0"
      >
        <v-card-title> О сервисе </v-card-title>
        <v-card-subtitle> {{ appName }} </v-card-subtitle>
        <v-card-text>
          Данный онлайн сервис разработан специально для перевода строки текста
          из русской раскладки в английскую. Он ориентирован на пользователей,
          которые используют пароли на русском языке (зашифрованные в русской
          раскладке). Такие пароли очень удобны: они легко запоминаются, а
          выглядят как набор бессмысленных латинских букв. Но имеют один
          существенный недостаток — при работе с мобильного устройства на экране
          смартфона (или планшета) отображается только английский набор
          символов. А чтобы ввести пароль из русских слов в английской раскладке
          — необходимо иметь компьютерную клавиатуру перед глазами. Для решения
          этой проблемы используйте наш сервис. Сервис меняет раскладку в
          обратную сторону, конвертируя русские слова в набор латинских символов
          (включая специальные знаки: запятые, слэши и пр.).
        </v-card-text>
        <v-card-actions>
          <v-btn text color="indigo" @click="home()"> Назад </v-btn>
        </v-card-actions>
      </v-card>
    </v-flex>
  </v-layout>
</template>

<script>
export default {
  layout: "default",
  data: () => ({}),
  computed: {
    appName() {
      return this.$store.state.appName;
    },
  },
  methods: {
    home: function() {
      this.$router.push(`/`);
    },
  },
};
</script>
