<template>
  <v-container fill-height fluid>
    <v-row align="center" justify="space-around">
      <v-col cols="10" xl="5" lg="5" md="5" sm="6">
        <v-img
          contain
          width="600"
          :src="require('~/assets/img/about.svg')"
          class="d-block ml-auto mr-auto"
        />
      </v-col>
      <v-col cols="10" xl="4" lg="4" md="5" sm="10">
        <h1 class="font-weight-light display-1">
          <strong>About</strong>
        </h1>
        <h3 class="subtitle-2 my-2">
          Данный онлайн сервис разработан специально для перевода строки текста
          из русской раскладки в английскую. Он ориентирован на пользователей,
          которые используют пароли на русском языке (зашифрованные в русской
          раскладке). Такие пароли очень удобны: они легко запоминаются, а
          выглядят как набор бессмысленных латинских букв. Но имеют один
          существенный недостаток — при работе с мобильного устройства на экране
          смартфона (или планшета) отображается только английский набор
          символов. А чтобы ввести пароль из русских слов в английской раскладке
          — необходимо иметь компьютерную клавиатуру перед глазами. Для решения
          этой проблемы используйте наш сервис. Сервис меняет раскладку в
          обратную сторону, конвертируя русские слова в набор латинских символов
          (включая специальные знаки: запятые, слэши и пр.).
        </h3>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
export default {
  head() {
    return {
      title: this.$i18n.t('about.title')
    };
  },
  data() {
    return {};
  }
};
</script>
